app/controllers/activations_controller.rb

SELECT "activations".* FROM "activations" WHERE ("activations"."deleted_at" IS NULL)
---
  def index
    @activations = Activation.all