app/controllers/organizations_controller.rb

SELECT "organizations".* FROM "organizations" WHERE ("organizations"."deleted_at" IS NULL)
---
  def set_organization
    @organization = current_user.administrated_organizations.find(params[:id])